---
kind: other
id: Methods.T:Autodesk.Revit.DB.APIObject
source: html/4bb1b7e0-bc71-65ac-89f1-2f7b92209fb9.htm
---
# APIObject Methods

Causes the object to release immediately any resources it may be utilizing.